# FieldDomainPointsByUV Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldDomainPointsByUV Class
Members See Also
---
Represents a set of two-dimensional point coordinates (defined usually on surface)
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FieldDomainPointsByUV : FieldDomainPoints
```

Visual Basic
---
```text
Public Class FieldDomainPointsByUV _
	Inherits FieldDomainPoints
```

Visual C++
---
```text
public ref class FieldDomainPointsByUV : public FieldDomainPoints
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..FieldDomainPoints Autodesk.Revit.DB.Analysis..::..FieldDomainPointsByUV
# See Also
FieldDomainPointsByUV Members
Autodesk.Revit.DB.Analysis Namespace